[
  {
    "name": "awareness",
    "description": "denotes messages simply mentioning concerns on the effect of decisions on cost, without necessarily implying any action taken."
  },
  {
    "name": "increase",
    "description": "denotes messages indicating increase in cost due to a change."
  },
  {
    "name": "save",
    "description": "denotes mentioned changes explicitly made to save costs."
  },
  {
    "name": "change",
    "description": "denotes messages indicating (semi-)permanent changes that affect costs."
  },
  {
    "name": "test",
    "description": "denotes messages indicating temporary changes for the purpose of testing their effect on costs."
  },
  {
    "name": "track",
    "description": "denotes messages indicating the use of cost-tracking features as offered (e.g. by service providers)."
  },
  {
    "name": "alert",
    "description": "denotes messages related to billing alarms (e.g. enforcing an upper threshold on costs)."
  },
  {
    "name": "area",
    "description": "denotes messages related to the geographical location of one or more resources (e.g. server or instance)."
  },
  {
    "name": "billing_mode",
    "description": "denotes messages related to the type of billing plan being used (e.g. on-demand for development or reserved plan for production)."
  },
  {
    "name": "cluster",
    "description": "denotes messages related to cluster configuration (e.g. for managed Kubernetes clusters)."
  },
  {
    "name": "cpu",
    "description": "denotes messages explicitly related to CPU configurations."
  },
  {
    "name": "domain",
    "description": "denotes messages related to domain name system and IP addresses."
  },
  {
    "name": "feature",
    "description": "denotes messages related to the incurred costs generated by various application features such as application logs, load balancers or usage of third party libraries or solutions."
  },
  {
    "name": "instance",
    "description": "denotes messages related to computational instances (e.g. Amazon AWS t2.micro) used in the deployment."
  },
  {
    "name": "logging",
    "description": "denotes messages related to the lifecycle of cost-tracking logging on the provider side."
  },
  {
    "name": "nat",
    "description": "denotes messages explicitly related to NAT configurations."
  },
  {
    "name": "networking",
    "description": "denotes messages related to networking configuration."
  },
  {
    "name": "policy",
    "description": " denotes messages related to the implementation of organizational rules and processes, both automated and manual, to prevent excessive costs."
  },
  {
    "name": "provider",
    "description": "denotes messages related to choosing a specific service provider (e.g. Amazon Web Services, Microsoft Azure, Google Cloud Platform)"
  },
  {
    "name": "ram",
    "description": "denotes messages explicitly related to RAM configurations."
  },
  {
    "name": "report",
    "description": "denotes messages related to the use of cost reports for one or more cloud services."
  },
  {
    "name": "service",
    "description": "denotes messages related to the adoption of specific cloud services (e.g. AWS Lambda, AWS EC2, AWS CloudWatch)."
  },
  {
    "name": "storage",
    "description": "denotes messages related to specific storage solutions and their types (e.g. AWS S3 Glacier) used in the deployment."
  },
  {
    "name": "vpn",
    "description": "denotes messages explicitly related to VPN configurations."
  }
]